<template>
  <div class="about">
   <h3>ขอเพียงแค่ถ่ายรูปเรา</h3>
    <p class="text"> ถ้าคุณเคยเห็นพวกเรา สุนัขหรือแมวจรจัดวิ่งไปมาอยู่บริเวณบ้านคุณบ้าง แถวที่ทำงานบ้าง หน้า 7-11 บ้าง 
พวกเราที่ไร้บ้านเหล่านี้ไม่มีแหล่งอาหารที่แน่นอน บ้างก็ไปคุ้ยกินตามถังขยะ บ้างก็มีผู้ใจบุญมาให้อาหาร
ไม่มีบ้านไม่มีที่นอนเป็นหลักเป็นแหล่ง ไม่มีความปลอดภัย บางทีโดนรถชนจนพิการ หรือตายไปบ้าง บางทีก็ไม่มีคนใส่ใจเรา
หรือเป็นเพราะเขาเหล่านั้นเขาไม่รู้จะทำอย่างไร แจ้งตำรวจ โทรแจ้งมูลนิธิ หรือทำอย่างไรดี?</p>
<p> <v-icon dark>pets</v-icon></p>
 <p class="text">Helpmepets เห็นความสำคัญชีวิตของพวกเราเหล่านี้  เครื่องมือที่สร้างขึ้นจึงมีไว้เพียงเพื่อ เมื่อใดก็ตามที่พวกเขาเจอพวกเรา เพียงแค่ ถ่ายรูป และใส่คำอธิบายเล็กน้อย โพสเข้าไปในแอปพลิเคชั่น แล้วแชร์ไปยังโซเชียลอื่นๆก็ได้ ใครก็ตามที่มาเห็น จะได้รู้ว่าพวกเราอยู่ที่ไหนบ้าง เผื่อว่าเราจะมีอาหาร หรือมาเล่นกับพวกเราบ้าง บางทีเค้าอาจจะรับเราให้ไปอยู่บ้านเดียวกันก็ได้ ถ้าพวกเขาถูกใจเรา กด favorite ในแอพไว้ก็ได้นะ จะได้ไม่ลืมว่าพวกเราอยู่ที่ไหน เราจะได้เจอกันบ่อยๆ  เหมือนพวกเราบางตัวที่ไม่เคยลืมเจ้าของของเราเลย :'(</p>
  </div>
</template>

<script>
export default {
  name: 'about',
  data () {
    return {
      msg: 'Welcome to Your Vue.js PWA'
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.about{
  padding: 0px 20px;

      min-height: calc(100vh - 56px - 56px)!important;
      margin: -10px;
      
}
.about .text{
background-color: rgba(255,255,255,0.6);
      border-radius: 15px;
      padding: 15px;
      text-align: left !important;
}
h1, h2 {
  font-weight: normal;
}

ul {
  list-style-type: none;
  padding: 0;
}

li {
  display: inline-block;
  margin: 0 10px;
}

a {
  color: #42b983;
}
</style>
